# Procesamiento de datos para Análisis 3: Flujo de aéreo y terrestre

Se realizará una nueva tabla de hechos que condense los 3 tipos de infraestructura, paeaje, aeropuerto origen y aeropuerto destino.

## Datos aeropuertos

In [121]:
import pandas as pd
fact_aero = pd.read_csv("datos modificados/aeropuertos_historico_v3.csv", index_col=0)

In [122]:
fact_aero.head()

,cod_origen,cod_destino,tipo_equipo,tipo_vuelo,trafico,empresa,vuelos,pasajeros_capacidad,carga_capacidad,pasajeros_transportados,carga_transportada,cod_fecha
0,BOG,BOG,BE20,T,N,APSA,1,0,0.0,0,0.0,2004_11
1,BOG,EJA,BE20,T,N,APSA,1,0,0.0,0,0.0,2004_05
2,BOG,GIR,BE20,T,N,APSA,1,0,0.0,0,0.0,2004_11
3,BOG,GYM,BE20,T,N,APSA,1,0,0.0,0,0.0,2004_03
4,BOG,SOX,BE20,T,N,APSA,1,0,0.0,0,0.0,2004_10

In [123]:
aero = pd.read_csv("datos modificados/aeropuertos_v3.csv", index_col=0)

In [124]:
aero.head()

,sigla,nombre,municipio,departamento,categoria,latitud,longitud,propietario,explotador,longitud_pista,ancho_pista,pbmo,elevacion,resolucion,clase,tipo,gcd_departamento,gcd_municipio
0,4JC,JUANCHACO,Buenaventura,Valle del Cauca,Aeródromo,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,76,76109
1,7FU,LA ESCONDIDA,Puerto Gaitán,Meta,Aeródromo,4.6108,-71.1935,PALMAS SICARARE S.A.S.,COSARGO S.A.S.,1300.0,18.0,5000.0,564.0,"1843,000",1A,Fumigación,50,50568
2,7GC,SAN FELIPE DEL PAUTO,Trinidad,Casanare,Aeródromo,5.2032,-70.8951,AGRAS S.A.S,AGRAS S.A.S,720.0,10.0,3000.0,3125.0,"4505,000",1A,Privado,85,85430
3,7GD,VELASQUEZ,Puerto Boyacá,Boyacá,Aeródromo,5.9482,-74.4575,FAC,MANSAROVAR,1500.0,18.0,10000.0,617.0,"2135,000",3C,Privado,15,15572
4,7GF,LA UNION,Paz de Ariporo,Casanare,Aeródromo,5.6283,-70.7032,MARTHA Y. VARGAS DE R.,GEOPARK CUERVA,640.0,18.0,3500.0,335.0,"2136,000",1A,Privado,85,85250

## Eliminación de datos de trafico aéreo anteriores a 2014

In [125]:
fact_aero = fact_aero[fact_aero.cod_fecha >= "2014_01"]
print('Cantidad de datos con desdes 2014:',len(fact_aero.index))

Cantidad de datos con desdes 2014: 63993

In [126]:
min = fact_aero['cod_fecha'].min()
max = fact_aero['cod_fecha'].max()

print('Min', min, 'Max', max)
fact_aero.head()

Min 2014_01 Max 2018_12

,cod_origen,cod_destino,tipo_equipo,tipo_vuelo,trafico,empresa,vuelos,pasajeros_capacidad,carga_capacidad,pasajeros_transportados,carga_transportada,cod_fecha
124374,ADZ,BAQ,C560,T,N,CENTRAL CHARTER,1,0,0.0,0,0.0,2014_04
124375,ADZ,CLO,H25B,T,N,CENTRAL CHARTER,1,0,0.0,0,0.0,2014_12
124376,BAQ,ADZ,C560,T,N,CENTRAL CHARTER,1,0,0.0,0,0.0,2014_04
124377,BOG,CLO,C560,T,N,CENTRAL CHARTER,2,0,0.0,0,0.0,2014_04
124378,BOG,CLO,C560,T,N,CENTRAL CHARTER,1,0,0.0,0,0.0,2014_06

## Creación de nueva dimension Infraestructura

Es importante mencionar que la columna tipo tiene 3 valores posibles. "aero_origen", "aero_destino", "peaje"

In [127]:
infra1 = aero.filter(['sigla','nombre','departamento'], axis=1)
infra1['sigla'] = infra1['sigla'] +'_O'
infra2 = aero.filter(['sigla','nombre','departamento'], axis=1)
infra2['sigla'] = infra1['sigla'] +'_D'
infra1.head()

   sigla                nombre     departamento
0  4JC_O             JUANCHACO  Valle del Cauca
1  7FU_O          LA ESCONDIDA             Meta
2  7GC_O  SAN FELIPE DEL PAUTO         Casanare
3  7GD_O             VELASQUEZ           Boyacá
4  7GF_O              LA UNION         Casanare

In [128]:
infra1['tipo'] = 'aero_origen'
infra1.head()

   sigla                nombre     departamento         tipo
0  4JC_O             JUANCHACO  Valle del Cauca  aero_origen
1  7FU_O          LA ESCONDIDA             Meta  aero_origen
2  7GC_O  SAN FELIPE DEL PAUTO         Casanare  aero_origen
3  7GD_O             VELASQUEZ           Boyacá  aero_origen
4  7GF_O              LA UNION         Casanare  aero_origen

In [129]:
infra2['tipo'] = 'aero_destino'
infra2.head()

     sigla                nombre     departamento          tipo
0  4JC_O_D             JUANCHACO  Valle del Cauca  aero_destino
1  7FU_O_D          LA ESCONDIDA             Meta  aero_destino
2  7GC_O_D  SAN FELIPE DEL PAUTO         Casanare  aero_destino
3  7GD_O_D             VELASQUEZ           Boyacá  aero_destino
4  7GF_O_D              LA UNION         Casanare  aero_destino

In [130]:
frames = [infra1, infra2]

infra = pd.concat(frames)
infra.head()

   sigla                nombre     departamento         tipo
0  4JC_O             JUANCHACO  Valle del Cauca  aero_origen
1  7FU_O          LA ESCONDIDA             Meta  aero_origen
2  7GC_O  SAN FELIPE DEL PAUTO         Casanare  aero_origen
3  7GD_O             VELASQUEZ           Boyacá  aero_origen
4  7GF_O              LA UNION         Casanare  aero_origen

In [131]:
infra.tail()

       sigla                 nombre departamento          tipo
520  YOP_O_D             TROMPILLOS     Casanare  aero_destino
521  YPL_O_D                CIENAGA     Casanare  aero_destino
522  YPP_O_D         GERMAN ALBERTO     Casanare  aero_destino
523  YYP_O_D             LOS CABROS     Casanare  aero_destino
524  ZPS_O_D  GUILLERMO GOMEZ ORTIZ    Santander  aero_destino

In [132]:
infra['sigla'].value_counts()

PPN_O_D    1
VNU_O      1
VNL_O      1
MVU_O      1
TRR_O      1
          ..
MAG_O_D    1
APO_O      1
TLU_O      1
MPI_O_D    1
EJU_O      1
Name: sigla, Length: 1050, dtype: int64

In [133]:
infra = infra.rename(columns={'sigla': 'codigo'})
infra.head()

  codigo                nombre     departamento         tipo
0  4JC_O             JUANCHACO  Valle del Cauca  aero_origen
1  7FU_O          LA ESCONDIDA             Meta  aero_origen
2  7GC_O  SAN FELIPE DEL PAUTO         Casanare  aero_origen
3  7GD_O             VELASQUEZ           Boyacá  aero_origen
4  7GF_O              LA UNION         Casanare  aero_origen

## Creacción de tabla de hechos

In [134]:
fact_infra1 = fact_aero.groupby(['cod_origen', 'cod_destino','cod_fecha']).agg({'pasajeros_transportados': 'sum'}).reset_index()
fact_infra1.tail()

      cod_origen cod_destino cod_fecha  pasajeros_transportados
26594        VVN         VVC   2018_03                        0
26595        VVN         VVC   2018_06                        0
26596        YAG         LCH   2018_06                        0
26597        YYP         VVC   2015_02                        0
26598        ZPS         BGA   2014_02                        0

In [135]:
min = fact_aero['pasajeros_transportados'].min()
max = fact_aero['pasajeros_transportados'].max()

print('Min', min, 'Max', max)

Min 0 Max 75424

In [136]:
fact_infra2 = fact_infra1.filter(['cod_origen','cod_fecha','pasajeros_transportados'], axis=1)
fact_infra2['cod_origen'] = fact_infra2['cod_origen'] +'_O'
fact_infra2 = fact_infra2.rename(columns={'cod_origen': 'codigo_infra'})
fact_infra2.head()

  codigo_infra cod_fecha  pasajeros_transportados
0        4JC_O   2018_09                        0
1        4JC_O   2014_03                        0
2        4JC_O   2015_03                        0
3        4JC_O   2015_12                        0
4        4JC_O   2016_05                        0

In [137]:
fact_infra3 = fact_infra1.filter(['cod_destino','cod_fecha','pasajeros_transportados'], axis=1)
fact_infra3['cod_destino'] = fact_infra3['cod_destino'] +'_D'
fact_infra3 = fact_infra3.rename(columns={'cod_destino': 'codigo_infra'})

fact_infra3.head()

  codigo_infra cod_fecha  pasajeros_transportados
0        BBA_D   2018_09                        0
1        BEE_D   2014_03                        0
2        BUN_D   2015_03                        0
3        BUN_D   2015_12                        0
4        BUN_D   2016_05                        0

In [138]:
frames = [fact_infra2, fact_infra3]

fact_infra = pd.concat(frames)
fact_infra = fact_infra.rename(columns={'pasajeros_transportados': 'cantidad_personas'})
fact_infra.head()

  codigo_infra cod_fecha  cantidad_personas
0        4JC_O   2018_09                  0
1        4JC_O   2014_03                  0
2        4JC_O   2015_03                  0
3        4JC_O   2015_12                  0
4        4JC_O   2016_05                  0

In [139]:
fact_infra.tail()

      codigo_infra cod_fecha  cantidad_personas
26594        VVC_D   2018_03                  0
26595        VVC_D   2018_06                  0
26596        LCH_D   2018_06                  0
26597        VVC_D   2015_02                  0
26598        BGA_D   2014_02                  0

## Datos peajes

In [154]:
fact_peajes = pd.read_csv("./../E1/Tabla_hechos_recaudo_trafico.csv", index_col=0)
fact_peajes.head()

  NombreEstacionPeaje    Recaudo  Tráfico Cod_fecha
0            ACAPULCO  734081100  97515.0   2016Ene
1            ACAPULCO  599925400  76217.0   2016Feb
2            ACAPULCO  670704200  86264.0   2016Mar
3            ACAPULCO  588188700  75724.0   2016Abr
4            ACAPULCO  646357200  83620.0   2016May

In [155]:
peajes = pd.read_csv("./../E1/peajes.csv", index_col=0)
peajes.head()

,cod_via,nombre,admon,responsable,cat_1,cat_2,cat_3,cat_4,cat_5,cat_6,cat_7,cat_8,cat_9,eje_adicio,eje_adic_2,latitud,longitud,departamento,gcd_departamento
0,2507,ACAPULCO,CONCESION PACIFICO TRES S.A.S (ODINSA),Concesion ANI,11400,14100,14100,14100,33800,42400,48900,0,0,0,0,4.999049,-75.858869,Caldas,17
1,4511,AGUAS NEGRAS,Concesionaria Ruta Del Sol,INVIAS,10500,13300,31200,37400,43900,0,0,0,0,9500,9300,6.645326,-73.952462,Santander,68
2,5501,ALBARRACIN,Concesion Briceno - Tunja - Sogamoso,Concesion ANI,8000,8900,23000,28500,33500,0,0,0,0,8200,6800,5.290461,-73.583519,Cundinamarca,25
3,4504,ALTAMIRA,Concesion Aliadas para El Progreso,Concesion ANI,8500,9300,19500,24800,27900,0,0,0,0,8700,8400,2.142914,-75.700593,Huila,41
4,9010,ALTO PINO,Concesion Santa Marta Paraguachon S.A,Concesion ANI,9600,14800,11900,18900,27700,44700,56400,0,0,0,0,11.444874,-72.542352,La Guajira,44

## Agregar peajes a la dimensión infraestructura

In [156]:
peajes = peajes.filter(['nombre','departamento'], axis=1)
peajes['codigo'] = peajes['nombre'] 
peajes['tipo'] = 'peaje'
cols = list(peajes.columns.values)
print(cols)

['nombre', 'departamento', 'codigo', 'tipo']

In [157]:
peajes = peajes[['codigo','nombre', 'departamento', 'tipo']]
peajes.head()

         codigo        nombre  departamento   tipo
0      ACAPULCO      ACAPULCO        Caldas  peaje
1  AGUAS NEGRAS  AGUAS NEGRAS     Santander  peaje
2    ALBARRACIN    ALBARRACIN  Cundinamarca  peaje
3      ALTAMIRA      ALTAMIRA         Huila  peaje
4     ALTO PINO     ALTO PINO    La Guajira  peaje

In [158]:
frames = [infra, peajes]

infra = pd.concat(frames)
infra.head()

  codigo                nombre     departamento         tipo
0  4JC_O             JUANCHACO  Valle del Cauca  aero_origen
1  7FU_O          LA ESCONDIDA             Meta  aero_origen
2  7GC_O  SAN FELIPE DEL PAUTO         Casanare  aero_origen
3  7GD_O             VELASQUEZ           Boyacá  aero_origen
4  7GF_O              LA UNION         Casanare  aero_origen

In [159]:
infra.tail()

        codigo     nombre departamento   tipo
161    TURBACO    TURBACO      Bolivar  peaje
162       TUTA       TUTA       Boyaca  peaje
165   VALENCIA   VALENCIA        Cesar  peaje
169  VILLARICA  VILLARICA        Cauca  peaje
170    ZAMBITO    ZAMBITO    Santander  peaje

## Cambiar formato de codigo fecha

In [160]:
#pendiente
fact_peajes.head()

  NombreEstacionPeaje    Recaudo  Tráfico Cod_fecha
0            ACAPULCO  734081100  97515.0   2016Ene
1            ACAPULCO  599925400  76217.0   2016Feb
2            ACAPULCO  670704200  86264.0   2016Mar
3            ACAPULCO  588188700  75724.0   2016Abr
4            ACAPULCO  646357200  83620.0   2016May

In [161]:
fact_peajes = fact_peajes.filter(['NombreEstacionPeaje', 'Cod_fecha','Tráfico'], axis=1)
fact_peajes = fact_peajes.rename(columns={'NombreEstacionPeaje': 'codigo_infra', 'Cod_fecha':'cod_fecha','Tráfico':'cantidad_personas'})
fact_peajes.head()

  codigo_infra cod_fecha  cantidad_personas
0     ACAPULCO   2016Ene            97515.0
1     ACAPULCO   2016Feb            76217.0
2     ACAPULCO   2016Mar            86264.0
3     ACAPULCO   2016Abr            75724.0
4     ACAPULCO   2016May            83620.0

## Aproximación de personas por carro
A partir del siguiente link, se estima que el promedio de personas por carro es de 2.2, tomando (40+60*3 )/100
https://www.eltiempo.com/bogota/seis-de-cada-diez-personas-dijeron-compartir-su-vehiculo-en-bogota-90186

In [163]:
fact_peajes['cantidad_personas'] = 2.2*fact_peajes['cantidad_personas']
fact_peajes.head()

  codigo_infra cod_fecha  cantidad_personas
0     ACAPULCO   2016Ene           214533.0
1     ACAPULCO   2016Feb           167677.4
2     ACAPULCO   2016Mar           189780.8
3     ACAPULCO   2016Abr           166592.8
4     ACAPULCO   2016May           183964.0

### Concatenación de peajes y aeropuertos en la tabla de hechos

In [164]:
frames = [fact_infra, fact_peajes]

fact_infra = pd.concat(frames)
fact_infra.head()

  codigo_infra cod_fecha  cantidad_personas
0        4JC_O   2018_09                0.0
1        4JC_O   2014_03                0.0
2        4JC_O   2015_03                0.0
3        4JC_O   2015_12                0.0
4        4JC_O   2016_05                0.0

In [165]:
fact_infra.tail()

     codigo_infra cod_fecha  cantidad_personas
3235      ZAMBITO   2018Ago                0.0
3236      ZAMBITO  2018Sept                0.0
3237      ZAMBITO   2018Oct                0.0
3238      ZAMBITO   2018Nov                0.0
3239      ZAMBITO   2018Dic                0.0

## Generación de archivos Fechas

In [169]:
fechas = pd.read_csv("datos modificados/fechas_v1.csv", index_col=0)
fechas.head()

  Cod_fecha  Anio  Semestre  Cuatrimestre  Trimestre     Mes  Mes_numerico
0   2004_01  2004         1             1          1   Enero             1
1   2004_02  2004         1             1          1  Febreo             2
2   2004_03  2004         1             1          1   Marzo             3
3   2004_04  2004         1             1          2   Abril             4
4   2004_05  2004         1             2          2    Mayo             5

In [172]:
fechas = fechas[fechas.Cod_fecha >= "2014_01"]
print('Fechas desde 2014:',len(fechas.index))

Fechas desde 2014: 60

## Generación de archivos

In [173]:
fact_infra.to_csv('./datos modificados/fact_infra.csv', index=False)
infra.to_csv('./datos modificados/dim_infra.csv', index=False)
fechas.to_csv('./datos modificados/fechas_infra.csv', index=False)